# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

def ar_prog_create(a,n,d):
  list_1=[]
  return [a + (i - 1) * d for i in range(1, n + 1)]

a=int(input("Введите первый эл-т: "))
n=int(input("Введите разность: "))
d=int(input("Введите количество: "))
print (ar_prog_create(a,n,d))