# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло a[i] ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном списке урожайности грядки.

import random
def sp_rand(n):
  sp=[]
  for i in range(n):
   sp.append(random.randint(0,3)) 
  return sp

def seek_max_tree(sp_temp):
  sp_temp.insert(0,sp_temp[len(sp)-1])
  sp.append(sp_temp[1])
  max=0
  for i in range(1, len(sp_temp)-2):
    if sp_temp[i]+sp_temp[i-1]+sp_temp[i+1] >max:
      max=sp_temp[i]+sp_temp[i-1]+sp_temp[i+1]
  return max
  

n1=int(input("Сколько кустов в нашем славном кружке?: "))
sp=sp_rand(n1)
print(sp)
print(f'Максимальное количество захваченых за раз ягод может быть - {seek_max_tree(sp)}')