# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов 
# второго множества. Затем пользователь вводит сами элементы множеств.
import random
def sp_rand(n):
  sp=[]
  for i in range(n):
   sp.append(random.randint(-10,10)) 
  return sp


n1=int(input("Введите длину первой последовательности: "))
n2=int(input("Введите длину второй последовательности: "))
sp1=sp_rand(n1)
sp2=sp_rand(n2)
print (sp1)
print (sp2)
intersect_set = set(sp1) & set(sp2)
print (sorted(intersect_set))