# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки.Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

def seekXY(sum,multi):
  for i in range(1,1000):
    for j in range (1,1000):
      if i*j==multi and i+j==sum:
        return (i,j)
  return (-1)

try:
  sum=int(input("Введи сумму чисел X и Y: "))
  multi=int(input("Введи произведение чисел X и Y: "))
  n=seekXY(sum,multi)
  if n==-1:
    print ("Петя что то мутит")
  else:
    print (f'Задуманные числа {n}')
  
except:
  print ("Числа это цифорки, а не буковки")